/* Compound */
"%[Any]@ of the following are true" = "以下の条件の %[いずれかと一致した]@ 項目";
"%[All]@ of the following are true" = "以下の条件の %[すべてと一致した]@ 項目";
"%[None]@ of the following are true" = "以下の条件の %[いずれも一致しない]@ 項目";

/* Name, path, relative path, extension */
"%[name]@ %[is]@ %@" = "%[名前が]@ %[次と等しい]@ %@";
"%[path]@ %[is]@ %@" = "%1$[パスが]@ %2$[次と等しい]@ %3$@";
"%[relativePath]@ %[is]@ %@" = "%[相対パスが]@ %[次と等しい]@ %@";
"%[extension]@ %[is]@ %@" = "%[拡張子が]@ %[次と等しい]@ %@";

"%[name]@ %[is not]@ %@" = "%[名前が]@ %[次と異なる]@ %@";
"%[path]@ %[is not]@ %@" = "%1$[パスが]@ %2$[次と異なる]@ %3$@";
"%[relativePath]@ %[is not]@ %@" = "%[相対パスが]@ %[次と異なる]@ %@";
"%[extension]@ %[is not]@ %@" = "%[拡張子が]@ %[次と異なる]@ %@";

"%[name]@ %[contains]@ %@" = "%[名前が]@ %[次を含む]@ %@";
"%[path]@ %[contains]@ %@" = "%1$[パスが]@ %2$[次を含む]@ %3$@";
"%[relativePath]@ %[contains]@ %@" = "%[相対パスが]@ %[次を含む]@ %@";
"%[extension]@ %[contains]@ %@" = "%1$[拡張子が]@ %2$[次を含む]@ %3$@";

"%[name]@ %[begins with]@ %@" = "%[名前が]@ %[次で始まる]@ %@";
"%[path]@ %[begins with]@ %@" = "%1$[パスが]@ %2$[次で始まる]@ %3$@";
"%[relativePath]@ %[begins with]@ %@" = "%[相対パスが]@ %[次で始まる]@ %@";
"%[extension]@ %[begins with]@ %@" = "%1$[拡張子が]@ %2$[次で始まる]@ %3$@";

"%[name]@ %[ends with]@ %@" = "%[名前が]@ %[次で終わる]@ %@";
"%[path]@ %[ends with]@ %@" = "%1$[パスが]@ %2$[次で終わる]@ %3$@";
"%[relativePath]@ %[ends with]@ %@" = "%[相対パスが]@ %[次で終わる]@ %@";
"%[extension]@ %[ends with]@ %@" = "%1$[拡張子が]@ %2$[次で終わる]@ %3$@";

"%[name]@ %[matches]@ %@" = "%[名前が]@ %[次と一致]@ %@";
"%[path]@ %[matches]@ %@" = "%1$[パスが]@ %2$[次と一致]@ %3$@";
"%[relativePath]@ %[matches]@ %@" = "%[相対パスが]@ %[次と一致]@ %@";
"%[extension]@ %[matches]@ %@" = "%1$[拡張子が]@ %2$[次と一致]@ %3$@";

/* Open document */
"%[open]@ %[is]@ %[0]@" = "%[オープン状況が]@ %[次と等しい]@ %[0]@";
"%[open]@ %[is]@ %[1]@" = "%[オープン状況が]@ %[次と等しい]@ %[1]@";

/* SCM status */
"%[hasSourceControlChanges]@ %[is]@ %[0]@" = "%[ソース管理状況が]@ %[次と等しい]@ %[0]@";
"%[hasSourceControlChanges]@ %[is]@ %[1]@" = "%[ソース管理状況が]@ %[次と等しい]@ %[1]@";

